/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kotadashirui <kotadashirui@student.42.f    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/03/31 11:40:40 by kotadashiru       #+#    #+#             */
/*   Updated: 2025/08/18 21:37:51 by kotadashiru      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char    *ft_strchr(const char *s, int c)
{
    int i;
    i = 0;
    while(s[i] != '\0')
    {
        if(s[i] == c)
        {
            return((char *)(s + i));//ここではなぜ符号なしcharでいいのか符号ありと符号なしの違いどう使い分けるのかがまだ曖昧
        }
        i++;
    }
    if((char)c == '\0')//これは完全にこの関数の仕様
    {
        return((char *)(s + i));
    }
    return(NULL);
}
