/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kotadashirui <kotadashirui@student.42.f    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/03/30 22:18:28 by kotadashiru       #+#    #+#             */
/*   Updated: 2025/08/18 21:44:44 by kotadashiru      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int     ft_toupper(int c)
{
    if((unsigned char)c >= 'a' && (unsigned char)c <= 'z')//負の値すなわちASCIIコード以外の値を拾ったとしてもバグが起こらないようにアスキーコードにしておく。
        c -= 32;
    return(c);
}
